Info: *******************************************************************
Info: Running Quartus Prime Analysis & Synthesis
    Info: Version 18.1.0 Build 625 09/12/2018 SJ Standard Edition
    Info: Copyright (C) 2018  Intel Corporation. All rights reserved.
    Info: Your use of Intel Corporation's design tools, logic functions 
    Info: and other software and tools, and its AMPP partner logic 
    Info: functions, and any output files from any of the foregoing 
    Info: (including device programming or simulation files), and any 
    Info: associated documentation or information are expressly subject 
    Info: to the terms and conditions of the Intel Program License 
    Info: Subscription Agreement, the Intel Quartus Prime License Agreement,
    Info: the Intel FPGA IP License Agreement, or other applicable license
    Info: agreement, including, without limitation, that your use is for
    Info: the sole purpose of programming logic devices manufactured by
    Info: Intel and sold by Intel or its authorized distributors.  Please
    Info: refer to the applicable agreement for further details.
    Info: Processing started: Wed Oct 14 22:04:05 2020
Info: Command: quartus_map mp3 -c mp3
Info (20029): Only one processor detected - disabling parallel compilation
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cache/array.sv
    Info (12023): Found entity 1: array File: /job/student/hdl/cache/array.sv Line: 3
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cache/cache.sv
    Info (12023): Found entity 1: cache File: /job/student/hdl/cache/cache.sv Line: 4
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cache/cache_control.sv
    Info (12023): Found entity 1: cache_control File: /job/student/hdl/cache/cache_control.sv Line: 4
Info (12021): Found 2 design units, including 2 entities, in source file hdl/cache/cache_datapath.sv
    Info (12023): Found entity 1: cache_datapath File: /job/student/hdl/cache/cache_datapath.sv Line: 5
    Info (12023): Found entity 2: comparator File: /job/student/hdl/cache/cache_datapath.sv Line: 208
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cache/cacheline_adaptor.sv
    Info (12023): Found entity 1: cacheline_adaptor File: /job/student/hdl/cache/cacheline_adaptor.sv Line: 4
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cache/data_array.sv
    Info (12023): Found entity 1: data_array File: /job/student/hdl/cache/data_array.sv Line: 5
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cache/bus_adapter.sv
    Info (12023): Found entity 1: bus_adapter File: /job/student/hdl/cache/bus_adapter.sv Line: 1
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cpu/control.sv
    Info (12023): Found entity 1: control File: /job/student/hdl/cpu/control.sv Line: 3
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cpu/cpu.sv
    Info (12023): Found entity 1: cpu File: /job/student/hdl/cpu/cpu.sv Line: 3
Info (12021): Found 2 design units, including 2 entities, in source file hdl/cpu/datapath.sv
    Info (12023): Found entity 1: datapath File: /job/student/hdl/cpu/datapath.sv Line: 5
    Info (12023): Found entity 2: cmp_module File: /job/student/hdl/cpu/datapath.sv Line: 251
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cpu/alu.sv
    Info (12023): Found entity 1: alu File: /job/student/hdl/cpu/alu.sv Line: 3
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cpu/ir.sv
    Info (12023): Found entity 1: ir File: /job/student/hdl/cpu/ir.sv Line: 3
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cpu/pc_reg.sv
    Info (12023): Found entity 1: pc_register File: /job/student/hdl/cpu/pc_reg.sv Line: 1
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cpu/regfile.sv
    Info (12023): Found entity 1: regfile File: /job/student/hdl/cpu/regfile.sv Line: 2
Info (12021): Found 1 design units, including 1 entities, in source file hdl/cpu/register.sv
    Info (12023): Found entity 1: register File: /job/student/hdl/cpu/register.sv Line: 1
Info (12021): Found 1 design units, including 1 entities, in source file hdl/mp3.sv
    Info (12023): Found entity 1: mp3 File: /job/student/hdl/mp3.sv Line: 3
Info (12021): Found 5 design units, including 0 entities, in source file hdl/rv32i_mux_types.sv
    Info (12022): Found design unit 1: pcmux (SystemVerilog) File: /job/student/hdl/rv32i_mux_types.sv Line: 4
    Info (12022): Found design unit 2: marmux (SystemVerilog) File: /job/student/hdl/rv32i_mux_types.sv Line: 12
    Info (12022): Found design unit 3: cmpmux (SystemVerilog) File: /job/student/hdl/rv32i_mux_types.sv Line: 19
    Info (12022): Found design unit 4: alumux (SystemVerilog) File: /job/student/hdl/rv32i_mux_types.sv Line: 26
    Info (12022): Found design unit 5: regfilemux (SystemVerilog) File: /job/student/hdl/rv32i_mux_types.sv Line: 42
Info (12021): Found 1 design units, including 0 entities, in source file hdl/rv32i_types.sv
    Info (12022): Found design unit 1: rv32i_types (SystemVerilog) File: /job/student/hdl/rv32i_types.sv Line: 5
Warning (10236): Verilog HDL Implicit Net warning at cacheline_adaptor.sv(43): created implicit net for "rst" File: /job/student/hdl/cache/cacheline_adaptor.sv Line: 43
Warning (10236): Verilog HDL Implicit Net warning at datapath.sv(83): created implicit net for "mem_address" File: /job/student/hdl/cpu/datapath.sv Line: 83
Info (12127): Elaborating entity "mp3" for the top level hierarchy
Info (12128): Elaborating entity "cpu" for hierarchy "cpu:cpu" File: /job/student/hdl/mp3.sv Line: 41
Info (12128): Elaborating entity "control" for hierarchy "cpu:cpu|control:control" File: /job/student/hdl/cpu/cpu.sv Line: 49
Warning (10036): Verilog HDL or VHDL warning at control.sv(41): object "trap" assigned a value but never read File: /job/student/hdl/cpu/control.sv Line: 41
Warning (10036): Verilog HDL or VHDL warning at control.sv(42): object "rs1_addr" assigned a value but never read File: /job/student/hdl/cpu/control.sv Line: 42
Warning (10036): Verilog HDL or VHDL warning at control.sv(42): object "rs2_addr" assigned a value but never read File: /job/student/hdl/cpu/control.sv Line: 42
Warning (10036): Verilog HDL or VHDL warning at control.sv(43): object "rmask" assigned a value but never read File: /job/student/hdl/cpu/control.sv Line: 43
Warning (10036): Verilog HDL or VHDL warning at control.sv(43): object "wmask" assigned a value but never read File: /job/student/hdl/cpu/control.sv Line: 43
Warning (10270): Verilog HDL Case Statement warning at control.sv(219): incomplete case statement has no default case item File: /job/student/hdl/cpu/control.sv Line: 219
Warning (10270): Verilog HDL Case Statement warning at control.sv(322): incomplete case statement has no default case item File: /job/student/hdl/cpu/control.sv Line: 322
Info (12128): Elaborating entity "datapath" for hierarchy "cpu:cpu|datapath:datapath" File: /job/student/hdl/cpu/cpu.sv Line: 52
Warning (10036): Verilog HDL or VHDL warning at datapath.sv(83): object "mem_address" assigned a value but never read File: /job/student/hdl/cpu/datapath.sv Line: 83
Warning (10230): Verilog HDL assignment warning at datapath.sv(83): truncated value with size 32 to match size of target (1) File: /job/student/hdl/cpu/datapath.sv Line: 83
Warning (10034): Output port "mem_addr" at datapath.sv(29) has no driver File: /job/student/hdl/cpu/datapath.sv Line: 29
Info (12128): Elaborating entity "ir" for hierarchy "cpu:cpu|datapath:datapath|ir:IR" File: /job/student/hdl/cpu/datapath.sv Line: 71
Info (12128): Elaborating entity "register" for hierarchy "cpu:cpu|datapath:datapath|register:MDR" File: /job/student/hdl/cpu/datapath.sv Line: 80
Info (12128): Elaborating entity "pc_register" for hierarchy "cpu:cpu|datapath:datapath|pc_register:pc_reg" File: /job/student/hdl/cpu/datapath.sv Line: 100
Info (12128): Elaborating entity "regfile" for hierarchy "cpu:cpu|datapath:datapath|regfile:regfile" File: /job/student/hdl/cpu/datapath.sv Line: 116
Info (12128): Elaborating entity "alu" for hierarchy "cpu:cpu|datapath:datapath|alu:ALU" File: /job/student/hdl/cpu/datapath.sv Line: 153
Info (12128): Elaborating entity "cmp_module" for hierarchy "cpu:cpu|datapath:datapath|cmp_module:CMP" File: /job/student/hdl/cpu/datapath.sv Line: 160
Info (12128): Elaborating entity "cache" for hierarchy "cache:cache" File: /job/student/hdl/mp3.sv Line: 62
Info (12128): Elaborating entity "cache_control" for hierarchy "cache:cache|cache_control:control" File: /job/student/hdl/cache/cache.sv Line: 47
Info (12128): Elaborating entity "cache_datapath" for hierarchy "cache:cache|cache_datapath:datapath" File: /job/student/hdl/cache/cache.sv Line: 52
Info (12128): Elaborating entity "comparator" for hierarchy "cache:cache|cache_datapath:datapath|comparator:tag1_check" File: /job/student/hdl/cache/cache_datapath.sv Line: 77
Info (12128): Elaborating entity "array" for hierarchy "cache:cache|cache_datapath:datapath|array:valid0" File: /job/student/hdl/cache/cache_datapath.sv Line: 90
Info (12128): Elaborating entity "array" for hierarchy "cache:cache|cache_datapath:datapath|array:tag0" File: /job/student/hdl/cache/cache_datapath.sv Line: 121
Info (12128): Elaborating entity "data_array" for hierarchy "cache:cache|cache_datapath:datapath|data_array:way0" File: /job/student/hdl/cache/cache_datapath.sv Line: 145
Info (12128): Elaborating entity "bus_adapter" for hierarchy "cache:cache|bus_adapter:bus_adapter" File: /job/student/hdl/cache/cache.sv Line: 58
Info (12128): Elaborating entity "cacheline_adaptor" for hierarchy "cacheline_adaptor:cacheline_adaptor" File: /job/student/hdl/mp3.sv Line: 86
Warning (13024): Output pins are stuck at VCC or GND
    Warning (13410): Pin "pmem_write" is stuck at GND File: /job/student/hdl/mp3.sv Line: 10
    Warning (13410): Pin "pmem_address[0]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[1]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[2]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[3]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[4]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[5]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[6]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[7]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[8]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[9]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[10]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[11]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[12]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[13]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[14]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[15]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[16]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[17]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[18]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[19]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[20]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[21]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[22]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[23]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[24]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[25]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[26]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[27]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[28]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[29]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[30]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_address[31]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 11
    Warning (13410): Pin "pmem_wdata[0]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[1]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[2]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[3]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[4]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[5]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[6]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[7]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[8]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[9]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[10]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[11]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[12]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[13]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[14]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[15]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[16]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[17]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[18]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[19]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[20]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[21]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[22]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[23]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[24]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[25]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[26]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[27]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[28]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[29]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[30]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[31]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[32]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[33]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[34]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[35]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[36]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[37]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[38]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[39]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[40]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[41]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[42]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[43]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[44]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[45]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[46]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[47]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[48]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[49]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[50]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[51]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[52]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[53]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[54]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[55]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[56]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[57]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[58]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[59]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[60]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[61]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[62]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
    Warning (13410): Pin "pmem_wdata[63]" is stuck at GND File: /job/student/hdl/mp3.sv Line: 13
Info (286030): Timing-Driven Synthesis is running
Info (17049): 4350 registers lost all their fanouts during netlist optimizations.
Info (144001): Generated suppressed messages file /job/student/output_files/mp3.map.smsg
Info (16010): Generating hard_block partition "hard_block:auto_generated_inst"
    Info (16011): Adding 0 node(s), including 0 DDIO, 0 PLL, 0 transceiver and 0 LCELL
Warning (21074): Design contains 64 input pin(s) that do not drive logic
    Warning (15610): No output dependent on input pin "pmem_rdata[32]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[33]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[34]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[35]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[36]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[37]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[38]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[39]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[40]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[41]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[42]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[43]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[44]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[45]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[46]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[47]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[48]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[49]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[50]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[51]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[52]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[53]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[54]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[55]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[56]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[57]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[58]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[59]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[60]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[61]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[62]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[63]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[0]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[1]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[2]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[3]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[4]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[5]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[6]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[7]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[8]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[9]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[10]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[11]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[12]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[13]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[14]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[15]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[16]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[17]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[18]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[19]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[20]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[21]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[22]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[23]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[24]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[25]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[26]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[27]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[28]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[29]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[30]" File: /job/student/hdl/mp3.sv Line: 8
    Warning (15610): No output dependent on input pin "pmem_rdata[31]" File: /job/student/hdl/mp3.sv Line: 8
Info (21057): Implemented 244 device resources after synthesis - the final resource count might be different
    Info (21058): Implemented 67 input pins
    Info (21059): Implemented 98 output pins
    Info (21061): Implemented 79 logic cells
Info: Quartus Prime Analysis & Synthesis was successful. 0 errors, 175 warnings
    Info: Peak virtual memory: 1159 megabytes
    Info: Processing ended: Wed Oct 14 22:04:27 2020
    Info: Elapsed time: 00:00:22
    Info: Total CPU time (on all processors): 00:00:20
Info: *******************************************************************
Info: Running Quartus Prime Shell
    Info: Version 18.1.0 Build 625 09/12/2018 SJ Standard Edition
    Info: Copyright (C) 2018  Intel Corporation. All rights reserved.
    Info: Your use of Intel Corporation's design tools, logic functions 
    Info: and other software and tools, and its AMPP partner logic 
    Info: functions, and any output files from any of the foregoing 
    Info: (including device programming or simulation files), and any 
    Info: associated documentation or information are expressly subject 
    Info: to the terms and conditions of the Intel Program License 
    Info: Subscription Agreement, the Intel Quartus Prime License Agreement,
    Info: the Intel FPGA IP License Agreement, or other applicable license
    Info: agreement, including, without limitation, that your use is for
    Info: the sole purpose of programming logic devices manufactured by
    Info: Intel and sold by Intel or its authorized distributors.  Please
    Info: refer to the applicable agreement for further details.
    Info: Processing started: Wed Oct 14 22:04:28 2020
Info: Command: quartus_sh -t /opt/altera/quartus/common/tcl/internal/nativelink/qnativesim.tcl --gen_script --rtl_sim mp3 mp3
Info: Quartus(args): --gen_script --rtl_sim mp3 mp3
Info: Info: Start Nativelink Simulation process
Info: Info: NativeLink has detected Verilog design -- Verilog simulation models will be used
Info: Info: Starting NativeLink simulation with ModelSim-Altera software
Info: Info: Generated ModelSim-Altera script file /job/student/simulation/modelsim/mp3_run_msim_rtl_verilog.do File: /job/student/simulation/modelsim/mp3_run_msim_rtl_verilog.do Line: 0
Info: Info: NativeLink simulation flow was successful
Info: Info: For messages from NativeLink scripts, check the file /job/student/mp3_nativelink_simulation.rpt File: /job/student/mp3_nativelink_simulation.rpt Line: 0
Info (23030): Evaluation of Tcl script /opt/altera/quartus/common/tcl/internal/nativelink/qnativesim.tcl was successful
Info: Quartus Prime Shell was successful. 0 errors, 0 warnings
    Info: Peak virtual memory: 787 megabytes
    Info: Processing ended: Wed Oct 14 22:04:28 2020
    Info: Elapsed time: 00:00:00
    Info: Total CPU time (on all processors): 00:00:00
Reading pref.tcl

# 10.5b

ModelSim> transcript on
ModelSim> > > if {[file exists rtl_work]} {
	vdel -lib rtl_work -all
}
ModelSim> vlib rtl_work
ModelSim> vmap work rtl_work
# Model Technology ModelSim - Intel FPGA Edition vmap 10.5b Lib Mapping Utility 2016.10 Oct  5 2016
# vmap work rtl_work 
# Modifying /opt/altera/modelsim_ase/linuxaloem/../modelsim.ini
ModelSim> 
> 
vlog -sv -work work +incdir+/job/student/hdl {/job/student/hdl/rv32i_mux_types.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl" /job/student/hdl/rv32i_mux_types.sv 
# -- Compiling package pcmux
# -- Compiling package marmux
# -- Compiling package cmpmux
# -- Compiling package alumux
# -- Compiling package regfilemux
# 
# Top level modules:
# 	--none--
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl {/job/student/hdl/rv32i_types.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl" /job/student/hdl/rv32i_types.sv 
# -- Compiling package pcmux
# -- Compiling package marmux
# -- Compiling package cmpmux
# -- Compiling package alumux
# -- Compiling package regfilemux
# -- Compiling package rv32i_types
# -- Importing package pcmux
# -- Importing package marmux
# -- Importing package cmpmux
# -- Importing package alumux
# -- Importing package regfilemux
# 
# Top level modules:
# 	--none--
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cache {/job/student/hdl/cache/array.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cache" /job/student/hdl/cache/array.sv 
# -- Compiling module array
# 
# Top level modules:
# 	array
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cache {/job/student/hdl/cache/cache_control.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cache" /job/student/hdl/cache/cache_control.sv 
# -- Compiling module cache_control
# 
# Top level modules:
# 	cache_control
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cache {/job/student/hdl/cache/cache_datapath.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cache" /job/student/hdl/cache/cache_datapath.sv 
# -- Compiling module cache_datapath
# -- Compiling module comparator
# 
# Top level modules:
# 	cache_datapath
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cache {/job/student/hdl/cache/cacheline_adaptor.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cache" /job/student/hdl/cache/cacheline_adaptor.sv 
# -- Compiling module cacheline_adaptor
# 
# Top level modules:
# 	cacheline_adaptor
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cache {/job/student/hdl/cache/data_array.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cache" /job/student/hdl/cache/data_array.sv 
# -- Compiling module data_array
# 
# Top level modules:
# 	data_array
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cache {/job/student/hdl/cache/bus_adapter.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cache" /job/student/hdl/cache/bus_adapter.sv 
# -- Compiling module bus_adapter
# 
# Top level modules:
# 	bus_adapter
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cpu {/job/student/hdl/cpu/pc_reg.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cpu" /job/student/hdl/cpu/pc_reg.sv 
# -- Compiling module pc_register
# 
# Top level modules:
# 	pc_register
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cpu {/job/student/hdl/cpu/regfile.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cpu" /job/student/hdl/cpu/regfile.sv 
# -- Compiling module regfile
# 
# Top level modules:
# 	regfile
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cpu {/job/student/hdl/cpu/register.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cpu" /job/student/hdl/cpu/register.sv 
# -- Compiling module register
# 
# Top level modules:
# 	register
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl {/job/student/hdl/rv32i_mux_types.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl" /job/student/hdl/rv32i_mux_types.sv 
# -- Compiling package pcmux
# -- Compiling package marmux
# -- Compiling package cmpmux
# -- Compiling package alumux
# -- Compiling package regfilemux
# 
# Top level modules:
# 	--none--
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cache {/job/student/hdl/cache/cache.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:29 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cache" /job/student/hdl/cache/cache.sv 
# -- Compiling module cache
# 
# Top level modules:
# 	cache
# End time: 22:04:29 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl {/job/student/hdl/rv32i_types.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:30 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl" /job/student/hdl/rv32i_types.sv 
# -- Compiling package pcmux
# -- Compiling package marmux
# -- Compiling package cmpmux
# -- Compiling package alumux
# -- Compiling package regfilemux
# -- Compiling package rv32i_types
# -- Importing package pcmux
# -- Importing package marmux
# -- Importing package cmpmux
# -- Importing package alumux
# -- Importing package regfilemux
# 
# Top level modules:
# 	--none--
# End time: 22:04:30 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cpu {/job/student/hdl/cpu/control.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:30 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cpu" /job/student/hdl/cpu/control.sv 
# -- Compiling package control_sv_unit
# -- Importing package rv32i_types
# -- Importing package pcmux
# -- Importing package marmux
# -- Importing package cmpmux
# -- Importing package alumux
# -- Importing package regfilemux
# -- Compiling module control
# 
# Top level modules:
# 	control
# End time: 22:04:30 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cpu {/job/student/hdl/cpu/datapath.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:30 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cpu" /job/student/hdl/cpu/datapath.sv 
# -- Compiling package datapath_sv_unit
# -- Importing package rv32i_types
# -- Importing package pcmux
# -- Importing package marmux
# -- Importing package cmpmux
# -- Importing package alumux
# -- Importing package regfilemux
# -- Compiling module datapath
# -- Compiling module cmp_module
# 
# Top level modules:
# 	datapath
# End time: 22:04:30 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cpu {/job/student/hdl/cpu/alu.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:30 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cpu" /job/student/hdl/cpu/alu.sv 
# -- Compiling package alu_sv_unit
# -- Importing package rv32i_types
# -- Importing package pcmux
# -- Importing package marmux
# -- Importing package cmpmux
# -- Importing package alumux
# -- Importing package regfilemux
# -- Compiling module alu
# 
# Top level modules:
# 	alu
# End time: 22:04:30 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cpu {/job/student/hdl/cpu/ir.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:30 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cpu" /job/student/hdl/cpu/ir.sv 
# -- Compiling package ir_sv_unit
# -- Importing package rv32i_types
# -- Importing package pcmux
# -- Importing package marmux
# -- Importing package cmpmux
# -- Importing package alumux
# -- Importing package regfilemux
# -- Compiling module ir
# 
# Top level modules:
# 	ir
# End time: 22:04:30 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl {/job/student/hdl/mp3.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:30 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl" /job/student/hdl/mp3.sv 
# -- Compiling package mp3_sv_unit
# -- Importing package rv32i_types
# -- Importing package pcmux
# -- Importing package marmux
# -- Importing package cmpmux
# -- Importing package alumux
# -- Importing package regfilemux
# -- Compiling module mp3
# 
# Top level modules:
# 	mp3
# End time: 22:04:30 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/cpu {/job/student/hdl/cpu/cpu.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:30 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hdl/cpu" /job/student/hdl/cpu/cpu.sv 
# -- Compiling package cpu_sv_unit
# -- Importing package rv32i_types
# -- Importing package pcmux
# -- Importing package marmux
# -- Importing package cmpmux
# -- Importing package alumux
# -- Importing package regfilemux
# -- Compiling module cpu
# 
# Top level modules:
# 	cpu
# End time: 22:04:30 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> 
> 
vlog -sv -work work +incdir+/job/student/hvl {/job/student/hvl/top.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 22:04:30 on Oct 14,2020
# vlog -sv -work work "+incdir+/job/student/hvl" /job/student/hvl/top.sv 
# -- Compiling interface top_itf
# ** Warning: ** while parsing file included at /job/student/hvl/top.sv(6)
# ** while parsing file included at hvl/cache/ag_cache_tb.sv(8)
# ** while parsing file included at hvl/cache/ag_cache_scoreboard.sv(3)
# ** at hvl/cache/ag_cache_model.sv(49): (vlog-2897) Using non-standard foreach loop variable list syntax.
# -- Compiling package top_sv_unit
# -- Importing package rv32i_types
# -- Importing package pcmux
# -- Importing package marmux
# -- Importing package cmpmux
# -- Importing package alumux
# -- Importing package regfilemux
# -- Importing package mp2_cpu_types
# -- Importing package ag_cache_types
# ** Warning: hvl/cache/ag_cache_model.sv(49): (vlog-2897) Using non-standard foreach loop variable list syntax.
# ** Warning: hvl/cache/ag_cache_sequencer_direct.sv(10): (vlog-2240) Treating stand-alone use of function '_build_slist' as an implicit VOID cast.
# ** Warning: hvl/cache/ag_cache_sequencer_direct.sv(13): (vlog-2250) Function "_build_slist" has no return value assignment.
# -- Compiling package mp2_cpu_types
# -- Compiling interface mp2_cpu_itf
# ** Warning: hvl/cache/ag_cache_model.sv(49): (vlog-2897) Using non-standard foreach loop variable list syntax.
# -- Compiling module riscv_formal_monitor_rv32i
# -- Compiling module riscv_formal_monitor_rv32i_rob
# -- Compiling module riscv_formal_monitor_rv32i_isa_spec
# -- Compiling module riscv_formal_monitor_rv32i_insn_add
# -- Compiling module riscv_formal_monitor_rv32i_insn_addi
# -- Compiling module riscv_formal_monitor_rv32i_insn_and
# -- Compiling module riscv_formal_monitor_rv32i_insn_andi
# -- Compiling module riscv_formal_monitor_rv32i_insn_auipc
# -- Compiling module riscv_formal_monitor_rv32i_insn_beq
# -- Compiling module riscv_formal_monitor_rv32i_insn_bge
# -- Compiling module riscv_formal_monitor_rv32i_insn_bgeu
# -- Compiling module riscv_formal_monitor_rv32i_insn_blt
# -- Compiling module riscv_formal_monitor_rv32i_insn_bltu
# -- Compiling module riscv_formal_monitor_rv32i_insn_bne
# -- Compiling module riscv_formal_monitor_rv32i_insn_jal
# -- Compiling module riscv_formal_monitor_rv32i_insn_jalr
# -- Compiling module riscv_formal_monitor_rv32i_insn_lb
# -- Compiling module riscv_formal_monitor_rv32i_insn_lbu
# -- Compiling module riscv_formal_monitor_rv32i_insn_lh
# -- Compiling module riscv_formal_monitor_rv32i_insn_lhu
# -- Compiling module riscv_formal_monitor_rv32i_insn_lui
# -- Compiling module riscv_formal_monitor_rv32i_insn_lw
# -- Compiling module riscv_formal_monitor_rv32i_insn_or
# -- Compiling module riscv_formal_monitor_rv32i_insn_ori
# -- Compiling module riscv_formal_monitor_rv32i_insn_sb
# -- Compiling module riscv_formal_monitor_rv32i_insn_sh
# -- Compiling module riscv_formal_monitor_rv32i_insn_sll
# -- Compiling module riscv_formal_monitor_rv32i_insn_slli
# -- Compiling module riscv_formal_monitor_rv32i_insn_slt
# -- Compiling module riscv_formal_monitor_rv32i_insn_slti
# -- Compiling module riscv_formal_monitor_rv32i_insn_sltiu
# -- Compiling module riscv_formal_monitor_rv32i_insn_sltu
# -- Compiling module riscv_formal_monitor_rv32i_insn_sra
# -- Compiling module riscv_formal_monitor_rv32i_insn_srai
# -- Compiling module riscv_formal_monitor_rv32i_insn_srl
# -- Compiling module riscv_formal_monitor_rv32i_insn_srli
# -- Compiling module riscv_formal_monitor_rv32i_insn_sub
# -- Compiling module riscv_formal_monitor_rv32i_insn_sw
# -- Compiling module riscv_formal_monitor_rv32i_insn_xor
# -- Compiling module riscv_formal_monitor_rv32i_insn_xori
# -- Compiling interface data_xchange_itf
# -- Compiling module cpu_tb
# -- Compiling package ag_cache_types
# -- Compiling interface ag_cache_itf
# -- Compiling module ag_cache_tb
# -- Compiling interface ag_dumb_itf
# -- Compiling module mp3_tb
# 
# Top level modules:
# 	mp3_tb
# End time: 22:04:30 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 0, Warnings: 5
ModelSim> 
> 
vsim -t 1ps -L altera_ver -L lpm_ver -L sgate_ver -L altera_mf_ver -L altera_lnsim_ver -L arriaii_hssi_ver -L arriaii_pcie_hip_ver -L arriaii_ver -L rtl_work -L work -voptargs="+acc"  mp3_tb
# vsim -t 1ps -L altera_ver -L lpm_ver -L sgate_ver -L altera_mf_ver -L altera_lnsim_ver -L arriaii_hssi_ver -L arriaii_pcie_hip_ver -L arriaii_ver -L rtl_work -L work -voptargs=""+acc"" mp3_tb 
# Start time: 22:04:30 on Oct 14,2020
# Loading sv_std.std
# Loading work.ag_cache_types
# Loading work.mp2_cpu_types
# Loading work.regfilemux
# Loading work.alumux
# Loading work.cmpmux
# Loading work.marmux
# Loading work.pcmux
# Loading work.rv32i_types
# Loading work.top_sv_unit
# Loading work.mp3_tb
# Loading work.top_itf
# Loading work.ag_dumb_itf
# Loading work.cpu_tb
# Loading work.mp2_cpu_itf
# Loading work.data_xchange_itf
# Loading work.mp3_sv_unit
# Loading work.mp3
# Loading work.cpu_sv_unit
# Loading work.cpu
# Loading work.control_sv_unit
# Loading work.control
# Loading work.datapath_sv_unit
# Loading work.datapath
# Loading work.ir_sv_unit
# Loading work.ir
# Loading work.register
# Loading work.pc_register
# Loading work.regfile
# Loading work.alu_sv_unit
# Loading work.alu
# Loading work.cmp_module
# Loading work.cache
# Loading work.cache_control
# Loading work.cache_datapath
# Loading work.comparator
# Loading work.array
# Loading work.data_array
# Loading work.bus_adapter
# Loading work.cacheline_adaptor
# Loading work.riscv_formal_monitor_rv32i
# Loading work.riscv_formal_monitor_rv32i_isa_spec
# Loading work.riscv_formal_monitor_rv32i_insn_add
# Loading work.riscv_formal_monitor_rv32i_insn_addi
# Loading work.riscv_formal_monitor_rv32i_insn_and
# Loading work.riscv_formal_monitor_rv32i_insn_andi
# Loading work.riscv_formal_monitor_rv32i_insn_auipc
# Loading work.riscv_formal_monitor_rv32i_insn_beq
# Loading work.riscv_formal_monitor_rv32i_insn_bge
# Loading work.riscv_formal_monitor_rv32i_insn_bgeu
# Loading work.riscv_formal_monitor_rv32i_insn_blt
# Loading work.riscv_formal_monitor_rv32i_insn_bltu
# Loading work.riscv_formal_monitor_rv32i_insn_bne
# Loading work.riscv_formal_monitor_rv32i_insn_jal
# Loading work.riscv_formal_monitor_rv32i_insn_jalr
# Loading work.riscv_formal_monitor_rv32i_insn_lb
# Loading work.riscv_formal_monitor_rv32i_insn_lbu
# Loading work.riscv_formal_monitor_rv32i_insn_lh
# Loading work.riscv_formal_monitor_rv32i_insn_lhu
# Loading work.riscv_formal_monitor_rv32i_insn_lui
# Loading work.riscv_formal_monitor_rv32i_insn_lw
# Loading work.riscv_formal_monitor_rv32i_insn_or
# Loading work.riscv_formal_monitor_rv32i_insn_ori
# Loading work.riscv_formal_monitor_rv32i_insn_sb
# Loading work.riscv_formal_monitor_rv32i_insn_sh
# Loading work.riscv_formal_monitor_rv32i_insn_sll
# Loading work.riscv_formal_monitor_rv32i_insn_slli
# Loading work.riscv_formal_monitor_rv32i_insn_slt
# Loading work.riscv_formal_monitor_rv32i_insn_slti
# Loading work.riscv_formal_monitor_rv32i_insn_sltiu
# Loading work.riscv_formal_monitor_rv32i_insn_sltu
# Loading work.riscv_formal_monitor_rv32i_insn_sra
# Loading work.riscv_formal_monitor_rv32i_insn_srai
# Loading work.riscv_formal_monitor_rv32i_insn_srl
# Loading work.riscv_formal_monitor_rv32i_insn_srli
# Loading work.riscv_formal_monitor_rv32i_insn_sub
# Loading work.riscv_formal_monitor_rv32i_insn_sw
# Loading work.riscv_formal_monitor_rv32i_insn_xor
# Loading work.riscv_formal_monitor_rv32i_insn_xori
# Loading work.riscv_formal_monitor_rv32i_rob
# Loading work.ag_cache_tb
# Loading work.ag_cache_itf
# ** Fatal: (vsim-3374) hvl/cpu/ag_cpu_tb.sv(106): MSB of part-select into 'mem_address' is out of bounds.
#    Time: 0 ps  Iteration: 0  Instance: /mp3_tb/cpu_dut File: hvl/cpu/ag_cpu_tb.sv
# FATAL ERROR while loading design
# Error loading design
# End time: 22:04:30 on Oct 14,2020, Elapsed time: 0:00:00
# Errors: 1, Warnings: 0
